
# 코딩테스트 대비 기초 문제 풀이 
# Date : 2022. 06. 16.
# 삼성전자 기출 문제
#-------------------------****----------------------------------
# N의 범위가 500인 경우 : 시간 복잡도가 O(N^3)인 알고리즘을 설계
# N의 범위가 2,000인 경우 : 시간 복잡도가 O(N^2)인 알고리즘을 설계
# N의 범위가 100,000인 경우 : 시간 복잡도가 O(NlogN)인 알고리즘을 설계
# N의 범위가 10,000,000인 경우 : 시간 복잡도가 O(N)인 알고리즘을 설계
#-------------------------****--------------------------------------------
import itertools
itertools.combinations
itertools.pro
itertools.
    
1  1
2  2
3  4
     3

4  11
5  12
6  14
7  21
8  22
9  24
10 41
11 42
12 44
      9

13 111
14 112
15 114
...

93 444

      27
  